tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "getantibody/tap"

brew "yadm"
brew "nvim"
brew "gpg"
brew "wget"
brew "zsh"
brew "antibody"

cask "google-chrome-dev"
cask "fonts/font-fira-code"
cask "iterm2"
cask "1password"
cask "spectacle"
cask "karabiner-elements"
cask "gpg-suite"

# Work tools
cask "slack"
cask "zoomus"
cask "docker"

# Personal stuff
cask "spotify"
cask "whatsapp"
