tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "getantibody/tap"

brew "yadm"
brew "nvim"
brew "gpg"
brew "wget"
brew "zsh"
brew "antibody"
brew "git"
brew "diff-so-fancy"
brew "python"
brew "python3"
brew "z"
brew "fzf"
brew "ripgrep"
brew "asdf"

# ASDF dependencies
%w(coreutils automake autoconf openssl libyaml readline libxslt libtool unixodbc unzip curl).each { |f| brew f }

cask "google-chrome-dev"
cask "fonts/font-fira-code"
cask "iterm2"
cask "1password"
cask "spectacle"
cask "karabiner-elements"
cask "gpg-suite"

# Work tools
cask "slack"
cask "zoomus"
cask "docker"
cask "fork"

# Personal stuff
cask "spotify"
cask "whatsapp"
